{
  "backend/main.mo": "Motoko canister defining client management types, access control, user profiles, and CRUD/query logic with onboarding, KYC, and activity log support.",
  "feature_evidence.json": "Feature evidence report listing two frontend modifications: reworked PDF download utility and filename generation update in ClientDetailPage.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each major frontend file’s purpose across routing, pages, components, onboarding, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing color tokens, radius, dark mode values, and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, and route definitions for all main pages.",
  "frontend/src/components/AppLayout.tsx": "Main layout with sidebar navigation, user profile display, and logout handling using Internet Identity.",
  "frontend/src/components/AuthGate.tsx": "Login screen rendering Internet Identity login flow with loading state.",
  "frontend/src/components/clients/ClientActivityLogTab.tsx": "Parses and displays client activity log entries in a table, showing recent changes first.",
  "frontend/src/components/clients/ClientIdentityKycTab.tsx": "Renders identity documents, KYC screening history, and current risk assessment sections for a client.",
  "frontend/src/components/clients/ClientOverviewTab.tsx": "Displays editable or read-only client overview fields using mock and client data, including contact and identity details.",
  "frontend/src/components/clients/CurrentRiskAssessmentSection.tsx": "Shows overall risk level, risk factors, and review dates with styling and an action button for new screening.",
  "frontend/src/components/clients/IdentityDocumentsSection.tsx": "Lists identity documents with verification status, metadata, and expiry status indicators.",
  "frontend/src/components/clients/KycScreeningHistorySection.tsx": "Displays a table of past KYC screenings with risk results, PEP/sanctions checks, and notes.",
  "frontend/src/components/onboarding/EditOnboardingCardDialog.tsx": "Dialog component for editing and moving an onboarding card, handling form state, date conversion, and mutation submission.",
  "frontend/src/components/onboarding/OnboardingClientCard.tsx": "Displays a client card with status, assignee, due date, and opens the edit dialog.",
  "frontend/src/components/onboarding/OnboardingKanbanBoard.tsx": "Builds a normalized six‑column kanban board and renders each onboarding stage with its cards.",
  "frontend/src/components/onboarding/OnboardingStageColumn.tsx": "Renders a single kanban column with a header and a list of client cards for that stage.",
  "frontend/src/components/onboarding/onboardingStages.ts": "Defines the ordered list of onboarding stages and helpers for stage lookup by name or number.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users to enter and save their name and email before proceeding.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/clear actions, and initializes AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, clients, onboarding data, and activity logs.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/mocks/clientDetailMock.ts": "Defines a mock client detail interface and generates deterministic mock KYC/identity details with alerts and screening history.",
  "frontend/src/mocks/clientsListMock.ts": "Provides a static list of mock ClientProfile entries with high IDs and preset personal and KYC fields.",
  "frontend/src/pages/AddClientPage.tsx": "Implements a form to create new clients, validating input and saving via backend or local fallback.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed client information with tabs, mock detail data, editing support, overrides, activity logs, and PDF export.",
  "frontend/src/pages/ClientsPage.tsx": "Shows a searchable, sortable client list combining backend, mock, and local clients with navigation to detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying client statistics and upcoming KYC review deadlines using query hooks and cards.",
  "frontend/src/pages/KYCScreeningPage.tsx": "Simple page showing a header for managing KYC screening and related checks.",
  "frontend/src/pages/OnboardingPage.tsx": "Onboarding pipeline page fetching pipeline data and rendering a kanban board with loading and error states.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page with a header describing available compliance and risk reports.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page providing a header for configuring application preferences.",
  "frontend/src/utils/clientActivityLog.ts": "LocalStorage-based utility for loading, appending, and clearing per-client activity log entries.",
  "frontend/src/utils/clientOverrides.ts": "Utility for storing, loading, and clearing per-client field overrides in localStorage.",
  "frontend/src/utils/clientPdfExport.ts": "Generates structured client PDF content by assembling profile and mock data into predefined sections.",
  "frontend/src/utils/format.ts": "Formatting utilities for dates, timestamps, IDs, labels, and expiry status calculations.",
  "frontend/src/utils/localClients.ts": "Manages locally stored clients, including ID generation, save/load, and updates with bigint handling.",
  "frontend/src/utils/pdfDownload.ts": "Provides helpers for sanitizing filenames and printing HTML content to PDF through a popup window.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based routes), storing/retrieving them in sessionStorage, and syncing URL values to persistent session state.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and layout settings with custom theme tokens and plugins for the frontend.",
  "project_state.json": "Defines the CRM project's current state, architecture notes, known issues, and planned features for the Swiss-style financial advisory application."
}