{
  "backend/main.mo": "Main backend actor implementing a CRM system with client profiles, onboarding pipeline, KYC tracking, admin/staff role-based access control, user profiles, dashboard statistics, and activity logging with migration support.",
  "backend/migration.mo": "Migration module that preserves admin entries from previous actor versions while explicitly dropping deprecated fields like canisterDeployer.",
  "feature_evidence.json": "Feature evidence report documenting removal of bootstrap logic from AppLayout.tsx and version number update from v41 to v42.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing component responsibilities, data flows, and UI behaviors across the React application.",
  "frontend/index.css": "Global Tailwind CSS styles with Swiss-minimalist design tokens using OKLCH color space for light and dark themes.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with authentication gating, authorization gating, profile setup dialog, and all page routes nested under a shared layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Empty component file with no implementation.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with sidebar navigation, user profile display with dynamic role badge (Admin/Staff/User) based on admin entry, logout functionality, and v42 version footer; bootstrap logic removed.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate displaying login screen with Internet Identity integration for unauthenticated users.",
  "frontend/src/components/AuthorizationGate.tsx": "Authorization gate that shows loading spinner while verifying actor access, then allows all authenticated users to proceed.",
  "frontend/src/components/clients/ClientActivityLogTab.tsx": "Displays a client's activity log in a table format, parsing both JSON and legacy log entry formats. Shows timestamp, user, action, details, and IP address for each activity, sorted newest first.",
  "frontend/src/components/clients/ClientIdentityKycTab.tsx": "A container component that renders three sections for client identity and KYC data: identity documents, KYC screening history, and current risk assessment.",
  "frontend/src/components/clients/ClientOverviewTab.tsx": "Displays client overview information in a grid of cards with editable fields. Handles both view and edit modes, pulling data from client profile, mock data, or original values.",
  "frontend/src/components/clients/CurrentRiskAssessmentSection.tsx": "Shows the client's current risk assessment including overall risk level badge, risk factors list, and assessment dates. Includes a button to initiate new screening.",
  "frontend/src/components/clients/IdentityDocumentsSection.tsx": "Displays identity documents (passport, ID, etc.) in a grid of cards showing document details, verification status, and expiry status with color-coded badges.",
  "frontend/src/components/clients/KycScreeningHistorySection.tsx": "Renders a table of KYC screening records showing date, screening type, risk level, PEP check, sanctions check results, screened by, and notes with color-coded status badges.",
  "frontend/src/components/onboarding/EditOnboardingCardDialog.tsx": "Dialog component for editing onboarding card details including stage, status, assigned person, and due date, with form submission that calls the useMoveClientToStage mutation.",
  "frontend/src/components/onboarding/OnboardingClientCard.tsx": "Card component displaying client onboarding information (name, status badge, assigned person, due date) with a button to open the edit dialog.",
  "frontend/src/components/onboarding/OnboardingKanbanBoard.tsx": "Kanban board container that normalizes pipeline data into six ordered stage columns and renders OnboardingStageColumn components.",
  "frontend/src/components/onboarding/OnboardingStageColumn.tsx": "Column component for a single onboarding stage that displays the stage name, card count badge, and list of OnboardingClientCard components.",
  "frontend/src/components/onboarding/onboardingStages.ts": "Constants and utility functions defining the six onboarding stages (Initial Contact through Account Activation) with helper functions for stage lookup by name or number.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A modal dialog component that prompts authenticated users without a profile to enter their name and email. It prevents closing until the profile is saved.",
  "frontend/src/components/settings/AdminManagementSection.tsx": "Admin management UI for viewing, adding, and removing admin/staff users with role-based access control, displaying a table of current admins and a form for adding new staff members.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, authorization, admin management, dashboard stats, clients, and onboarding operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (background, foreground, primary, secondary, borders, charts, sidebar) and base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/mocks/clientDetailMock.ts": "Generates deterministic mock data for client detail pages including personal info, contact details, identity documents, KYC status, tax information, financial profile, screening history, risk assessment, and alerts based on client ID.",
  "frontend/src/mocks/clientsListMock.ts": "Provides mock ClientProfile data for Swiss clients (Hans Mueller, Sophie Dubois, Marco Rossi, Elena Fischer) with high IDs (1000000+) to avoid backend collisions, including account details, KYC info, and risk levels.",
  "frontend/src/pages/AddClientPage.tsx": "Form page for creating new clients with validation, auto-generated account IDs, and fallback to local storage if backend save fails, then navigates to clients list on success.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays comprehensive client details across multiple tabs (overview, identity/KYC, activity log) with edit mode, PDF export functionality, and merges data from backend, mock data, local storage, and overrides.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients in a sortable, searchable table by merging backend, local, and mock clients, with navigation to detail pages and an add client button.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard overview with client statistics cards (total, active, onboarding, high-risk) and a list of upcoming KYC review deadlines using data from useGetDashboardStats and useGetAllClients hooks.",
  "frontend/src/pages/KYCScreeningPage.tsx": "Placeholder page for KYC screening functionality with header and description; no implementation yet.",
  "frontend/src/pages/OnboardingPage.tsx": "Displays onboarding pipeline as a Kanban board using useGetOnboardingPipeline hook, with loading skeletons and error handling.",
  "frontend/src/pages/ReportsPage.tsx": "Placeholder page for compliance reports with header and description; no implementation yet.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that renders AdminManagementSection component for configuring application preferences.",
  "frontend/src/utils/clientActivityLog.ts": "LocalStorage utility for managing per-client activity logs with functions to load, append, and clear entries, supporting both ActivityLogEntry and LocalActivityLogEntry formats.",
  "frontend/src/utils/clientOverrides.ts": "LocalStorage utility for managing per-client field overrides with functions to load, save, and clear override records.",
  "frontend/src/utils/clientPdfExport.ts": "Generates PDF content for client profiles by building structured sections (Contact Details, Personal Data, Mandate, Wallets, Compliance, VQF) from ClientProfile and MockClientDetail data.",
  "frontend/src/utils/format.ts": "Provides formatting utilities for dates, timestamps, client IDs, status labels, risk levels, and document expiry status with color coding for UI display.",
  "frontend/src/utils/localClients.ts": "LocalStorage utility for managing locally-created client profiles with functions to generate IDs, save, retrieve, and update clients starting from ID 5000000.",
  "frontend/src/utils/pdfDownload.ts": "Handles PDF generation by opening HTML content in a new window with auto-print functionality, including filename sanitization and date formatting utilities.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking file documenting architectural decisions to hardcode admin initialization in main.mo, existing features for UI updates (v41 to v42), and pending feature requests to remove bootstrap logic."
}