{
  "backend/main.mo": "Defines the main Motoko canister with client, onboarding, KYC, user, admin, and authorization data types plus initial storage and helper functions.",
  "feature_evidence.json": "Feature evidence report listing features, related frontend files, components, and test IDs for regression to Version 23 behavior.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files, describing their responsibilities and behaviors.",
  "frontend/index.css": "Tailwind base file defining Swiss-style OKLCH design tokens and global CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with authentication and authorization gates and routes for all main pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Shows an access-denied card UI when a user lacks authorization.",
  "frontend/src/components/AppLayout.tsx": "Renders sidebar navigation, user info, and logout handling, wrapping page content with TanStack Router's Outlet.",
  "frontend/src/components/AuthGate.tsx": "Displays login screen and triggers Internet Identity login with loading feedback.",
  "frontend/src/components/AuthorizationGate.tsx": "Checks authorization status and actor readiness, showing loading or denial screens before rendering children.",
  "frontend/src/components/clients/ClientActivityLogTab.tsx": "Parses and displays client activity log entries in a sortable table with support for old and new formats.",
  "frontend/src/components/clients/ClientIdentityKycTab.tsx": "Wrapper tab combining identity documents, KYC screening history, and risk assessment sections.",
  "frontend/src/components/clients/ClientOverviewTab.tsx": "Shows client contact and profile fields with optional edit mode using mock and stored data.",
  "frontend/src/components/clients/CurrentRiskAssessmentSection.tsx": "Displays overall risk level, factors, and assessment dates with option to initiate new screening.",
  "frontend/src/components/clients/IdentityDocumentsSection.tsx": "Renders identity documents with verification status, expiry info, and option to add new documents.",
  "frontend/src/components/clients/KycScreeningHistorySection.tsx": "Shows a table of past KYC screenings including risk results, PEP/sanctions checks, and notes.",
  "frontend/src/components/onboarding/EditOnboardingCardDialog.tsx": "Dialog component allowing users to update a client's onboarding stage, status, assignee, and due date, submitting changes via a mutation.",
  "frontend/src/components/onboarding/OnboardingClientCard.tsx": "Displays a client's onboarding card with status, assignee, and due date, and opens an edit dialog for modifications.",
  "frontend/src/components/onboarding/OnboardingKanbanBoard.tsx": "Builds a six-column kanban board by normalizing onboarding pipeline data and rendering each stage with its cards.",
  "frontend/src/components/onboarding/OnboardingStageColumn.tsx": "Renders a single kanban column showing a stage title, card count, and list of client cards.",
  "frontend/src/components/onboarding/onboardingStages.ts": "Defines the ordered list of onboarding stages and helper functions to map between stage names and numbers.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without profiles to submit name and email, saving via mutation.",
  "frontend/src/components/settings/AdminManagementSection.tsx": "Admin panel section for listing, adding, and removing admins, restricted to the operator and backed by related mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the current identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for users, admins, clients, dashboard stats, and onboarding mutations.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark CSS variables and base typography.",
  "frontend/src/main.tsx": "Bootstraps React app with React Query and Internet Identity provider.",
  "frontend/src/mocks/clientDetailMock.ts": "Generates deterministic mock client‑detail data including KYC, documents, risk, and alerts.",
  "frontend/src/mocks/clientsListMock.ts": "Provides a static list of mock client profiles with Swiss-style data and mock principals.",
  "frontend/src/pages/AddClientPage.tsx": "Form for creating a new client, validates input, saves via backend or local fallback.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays and edits detailed client info using backend, mock, and local data with PDF export and activity log merging.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, sort, and navigation, merging backend, mock, and local clients.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing client statistics and upcoming KYC review deadlines using data from query hooks.",
  "frontend/src/pages/KYCScreeningPage.tsx": "Static page header for managing KYC screening and related checks.",
  "frontend/src/pages/OnboardingPage.tsx": "Displays onboarding pipeline with loading skeletons, error state, and a Kanban board.",
  "frontend/src/pages/ReportsPage.tsx": "Simple reports page with a header describing available compliance reports.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that renders application settings and admin management.",
  "frontend/src/utils/clientActivityLog.ts": "LocalStorage utilities for loading, appending, and clearing per‑client activity logs.",
  "frontend/src/utils/clientOverrides.ts": "LocalStorage helpers for loading, saving, and clearing client field override data.",
  "frontend/src/utils/clientPdfExport.ts": "Generates structured PDF data for a client by compiling contact, personal, mandate, wallet, and compliance fields.",
  "frontend/src/utils/format.ts": "Formatting helpers for dates, IDs, status labels, risk labels, and document expiry status.",
  "frontend/src/utils/localClients.ts": "LocalStorage management for mock/local clients including ID generation, save/load, and updates.",
  "frontend/src/utils/pdfDownload.ts": "Utility to sanitize filenames and generate downloadable printable HTML-based PDFs.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and sessionStorage parameters, with support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "Tracks project metadata, rollback requirements, known issues, and feature restoration tasks for reverting to version 23 behavior."
}