{
  "backend/main.mo": "Main Motoko actor defining client management types (ClientProfile, OnboardingStep, KYCEntry, etc.), admin authorization types, and system storage with Map-based state for clients, user profiles, and admin allowlist, plus helper functions and user profile management endpoints.",
  "feature_evidence.json": "Feature evidence report documenting three requirements: reverting to v29 state with working admin bootstrap, replacing hardcoded 'User' badge with dynamic role display using useGetMyAdminEntry, and updating footer version from v29 to v31.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing App.tsx routing setup, AppLayout with sidebar and dynamic role badges, authentication/authorization gates, client management pages, hooks for backend queries, and utility functions for formatting.",
  "frontend/index.css": "Global Tailwind CSS styles with Swiss-minimalist design system using OKLCH color tokens for light and dark modes, defining CSS custom properties for colors, borders, and component theming.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'FE Swiss Financial'.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, authentication gating via AuthGate, authorization gating via AuthorizationGate, and route definitions for dashboard, clients, onboarding, KYC screening, reports, and settings pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a card with shield alert icon and message for unauthorized Principal IDs.",
  "frontend/src/components/AppLayout.tsx": "Shared layout component with sidebar navigation, displaying user name from caller profile and dynamic role badge (Admin/Staff/User) determined by useGetMyAdminEntry with enabled: !!identity guard, logout button, and footer showing version 'v31'.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component rendering a login card with Internet Identity integration and loading state during login process.",
  "frontend/src/components/AuthorizationGate.tsx": "A gate component that checks authorization status and actor state, showing a loading spinner during verification and an access denied screen if unauthorized.",
  "frontend/src/components/clients/ClientActivityLogTab.tsx": "Displays a sortable activity log table for client changes, parsing both JSON and legacy log entry formats and showing timestamp, user, action, details, and IP address.",
  "frontend/src/components/clients/ClientIdentityKycTab.tsx": "A container component that renders three sections: identity documents, KYC screening history, and current risk assessment using mock data.",
  "frontend/src/components/clients/ClientOverviewTab.tsx": "Displays client overview information in a two-column card layout with editable fields in edit mode, pulling data from client profile, original values, or mock data fallbacks.",
  "frontend/src/components/clients/CurrentRiskAssessmentSection.tsx": "Shows the client's overall risk level with color-coded badges, lists risk factors, and displays last assessment and next review dates with an option to initiate new screening.",
  "frontend/src/components/clients/IdentityDocumentsSection.tsx": "Displays identity documents (passport, etc.) in a grid of cards showing document details, verification status, and color-coded expiry status badges.",
  "frontend/src/components/clients/KycScreeningHistorySection.tsx": "Renders a table of KYC screening records with color-coded badges for screening type, risk level, PEP check, and sanctions check results.",
  "frontend/src/components/onboarding/EditOnboardingCardDialog.tsx": "Dialog component for editing onboarding card details including stage, status, assigned person, and due date, with form submission that calls useMoveClientToStage mutation.",
  "frontend/src/components/onboarding/OnboardingClientCard.tsx": "Card component displaying client onboarding information (name, status badge, assigned person, due date) with a button to open the edit dialog.",
  "frontend/src/components/onboarding/OnboardingKanbanBoard.tsx": "Kanban board container that normalizes backend pipeline data into six ordered stage columns and renders OnboardingStageColumn components.",
  "frontend/src/components/onboarding/OnboardingStageColumn.tsx": "Column component for a single onboarding stage, displaying stage name, card count badge, and list of OnboardingClientCard components.",
  "frontend/src/components/onboarding/onboardingStages.ts": "Constants and utility functions defining the six onboarding stages and providing stage name/index conversion helpers.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A modal dialog that prompts authenticated users without a profile to enter their name and email, preventing dismissal until the profile is completed.",
  "frontend/src/components/settings/AdminManagementSection.tsx": "Admin management UI for viewing admin list, adding staff members by Principal ID, and removing admins, with role-based access control checking if current user is operator.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with identity authentication, initializes access control, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, authorization, admin management, dashboard stats, and client operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (background, foreground, primary, secondary, sidebar, charts, etc.) and base typography styles.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/mocks/clientDetailMock.ts": "Mock data generator for detailed client information including personal info, contact details, identity documents, KYC status, tax information, financial profile, screening history, risk assessment, and alerts with deterministic data based on client ID.",
  "frontend/src/mocks/clientsListMock.ts": "Mock client profile data array containing Swiss-based sample clients with complete ClientProfile fields including personal details, account IDs, risk levels, and status information for testing and development.",
  "frontend/src/pages/AddClientPage.tsx": "Form page for creating new clients with validation, backend submission with local storage fallback on failure, auto-generated account IDs, and fields for personal information, contact details, and identity documents.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detailed client view page with tabbed interface (overview, identity/KYC, activity log), edit mode for overview fields, PDF export functionality, and data sourced from backend/mock/local storage with override support and activity logging.",
  "frontend/src/pages/ClientsPage.tsx": "Client list page with search, sortable table columns (name, onboarding date, status, risk level), and data merged from backend, local storage, and mock sources with navigation to detail pages and add client functionality.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard with client statistics cards (total, active, onboarding, high-risk) and a list of upcoming KYC review deadlines using data from useGetDashboardStats and useGetAllClients hooks.",
  "frontend/src/pages/KYCScreeningPage.tsx": "Placeholder page for KYC screening functionality with a title and description; no implementation yet.",
  "frontend/src/pages/OnboardingPage.tsx": "Displays an onboarding pipeline kanban board using useGetOnboardingPipeline hook, with loading skeletons and error handling.",
  "frontend/src/pages/ReportsPage.tsx": "Placeholder page for reports functionality with a title and description; no implementation yet.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that renders the AdminManagementSection component for configuring application preferences.",
  "frontend/src/utils/clientActivityLog.ts": "Provides localStorage-based utilities for managing per-client activity logs with functions to load, append, and clear log entries stored as JSON strings.",
  "frontend/src/utils/clientOverrides.ts": "Provides localStorage-based utilities for managing per-client field overrides with functions to load, save, and clear override data.",
  "frontend/src/utils/clientPdfExport.ts": "Generates HTML content for client profile PDFs by building structured sections from ClientProfile and MockClientDetail data including contact, personal, mandate, wallet, compliance, and VQF information.",
  "frontend/src/utils/format.ts": "Provides formatting utilities for dates, timestamps, client IDs, status labels, risk levels, and document expiry statuses with color-coded visual indicators.",
  "frontend/src/utils/localClients.ts": "Manages localStorage-based client profiles with functions to create, read, update local clients using IDs starting at 5000000 and auto-generated account IDs.",
  "frontend/src/utils/pdfDownload.ts": "Handles PDF generation by opening HTML content in a new window with auto-print functionality, including filename sanitization and blob URL management.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, extended theme settings for borders, shadows, fonts, and animations including accordion and sidebar components.",
  "project_state.json": "Project state tracking document showing a revert to version 29 to fix broken admin bootstrap and sidebar issues, with features for dynamic role display in sidebar and version number update to v31."
}