{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, and CRUD operations for clients with detailed client, KYC, and onboarding data types.",
  "feature_evidence.json": "Feature evidence report listing implemented UI features, affected files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH design tokens and light/dark theme variables for the UI.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main TypeScript entry file.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router routes, authentication gating, and layout rendering.",
  "frontend/src/components/AppLayout.tsx": "Main app layout with sidebar navigation, user profile display, and logout handling.",
  "frontend/src/components/AuthGate.tsx": "Login gate showing an Internet Identity login button and loading state for unauthenticated users.",
  "frontend/src/components/clients/ClientIdentityKycTab.tsx": "Combines identity documents, KYC screening history, and risk assessment sections using provided mock client data.",
  "frontend/src/components/clients/ClientOverviewTab.tsx": "Displays personal info, contact details, and identity documents for a client with formatted fields and expiry statuses.",
  "frontend/src/components/clients/CurrentRiskAssessmentSection.tsx": "Shows current risk level, factors, and assessment dates with option to initiate new screening.",
  "frontend/src/components/clients/IdentityDocumentsSection.tsx": "Renders a list of identity documents with verification and expiry status badges plus an add-document button.",
  "frontend/src/components/clients/KycScreeningHistorySection.tsx": "Table listing past KYC screenings with risk, PEP, sanctions results, and notes.",
  "frontend/src/components/onboarding/EditOnboardingCardDialog.tsx": "Dialog for updating an onboarding card’s stage, status, assignee, and due date with mutation to move client.",
  "frontend/src/components/onboarding/OnboardingClientCard.tsx": "Displays a client onboarding card with status, assignee, due date, and an edit dialog trigger.",
  "frontend/src/components/onboarding/OnboardingKanbanBoard.tsx": "Normalizes onboarding stages into fixed columns and renders them as a kanban board.",
  "frontend/src/components/onboarding/OnboardingStageColumn.tsx": "Renders a single onboarding stage column and its client cards or an empty-state message.",
  "frontend/src/components/onboarding/onboardingStages.ts": "Defines onboarding stage names and helpers for mapping between names and step numbers.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users to enter and save name and email before proceeding.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, persistence, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, clients, dashboard stats, and onboarding pipeline mutations.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/mocks/clientDetailMock.ts": "Generates deterministic mock client detail data with KYC info, documents, financials, and alerts.",
  "frontend/src/mocks/clientsListMock.ts": "Provides a static list of mock ClientProfile objects used as fallback or sample data in the UI.",
  "frontend/src/pages/AddClientPage.tsx": "Implements a form for creating new clients, handling submission, validation, and redirect after creation.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed client information with tabs and alerts, fetching data by ID and showing mock supplemental details.",
  "frontend/src/pages/ClientsPage.tsx": "Shows a sortable, searchable client list using backend data or mock data as fallback.",
  "frontend/src/pages/DashboardPage.tsx": "Displays client statistics and upcoming KYC review deadlines using dashboard and client queries.",
  "frontend/src/pages/KYCScreeningPage.tsx": "Stub page providing a header for the KYC screening section.",
  "frontend/src/pages/OnboardingPage.tsx": "Renders the onboarding pipeline with loading states, error handling, and a kanban board view.",
  "frontend/src/pages/ReportsPage.tsx": "Stub page showing a header for compliance reports.",
  "frontend/src/pages/SettingsPage.tsx": "Stub page showing a header for application settings.",
  "frontend/src/utils/format.ts": "Provides date formatting utilities, client ID formatting, status/risk label mapping, and expiry countdown helpers.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, container settings, animations, and plugin usage.",
  "project_state.json": "Describes the CRM project state, requirements, architecture notes, known issues, and implemented features."
}