{
  "backend/main.mo": "Defines actor canister with access control, admin management, client profiles, KYC data, onboarding steps, and storage maps with helper functions.",
  "feature_evidence.json": "Contains structured feature evidence for admin management UI behaviors, operator detection logic, and add/remove staff requirements.",
  "frontend-file-summaries.txt": "Lists short summaries of major frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color tokens for light and dark themes in a minimal Swiss design style.",
  "frontend/index.html": "Basic HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication and authorization gates, and routes for all major pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple screen showing an access denied message with UI card and icon.",
  "frontend/src/components/AppLayout.tsx": "Sidebar-based application layout showing navigation, user info, and logout with data from user and admin queries.",
  "frontend/src/components/AuthGate.tsx": "Login screen that triggers Internet Identity login and shows loading state.",
  "frontend/src/components/AuthorizationGate.tsx": "Wraps children with authorization checks, showing loaders or access denied as needed.",
  "frontend/src/components/clients/ClientActivityLogTab.tsx": "Parses and displays client activity logs in a table, supporting JSON and legacy formats.",
  "frontend/src/components/clients/ClientIdentityKycTab.tsx": "Aggregates identity documents, KYC history, and risk assessment sections for a client.",
  "frontend/src/components/clients/ClientOverviewTab.tsx": "Shows and optionally edits core client profile fields, mixing real and mock data.",
  "frontend/src/components/clients/CurrentRiskAssessmentSection.tsx": "Displays current risk level, factors, and dates with option to initiate new screening.",
  "frontend/src/components/clients/IdentityDocumentsSection.tsx": "Lists identity documents with status, metadata, expiry indicators, and add button.",
  "frontend/src/components/clients/KycScreeningHistorySection.tsx": "Displays a table of KYC screening records with badges for results and styling based on risk and check outcomes.",
  "frontend/src/components/onboarding/EditOnboardingCardDialog.tsx": "Dialog form for updating an onboarding card’s stage, status, assignee, and due date, using a mutation to save changes.",
  "frontend/src/components/onboarding/OnboardingClientCard.tsx": "Renders a client card showing onboarding status, assignee, and due date, with a button to open the edit dialog.",
  "frontend/src/components/onboarding/OnboardingKanbanBoard.tsx": "Builds a six‑column kanban board by normalizing backend pipeline data into stage‑based card columns.",
  "frontend/src/components/onboarding/OnboardingStageColumn.tsx": "Displays a single kanban column with its title, card count, and list of onboarding client cards.",
  "frontend/src/components/onboarding/onboardingStages.ts": "Defines the fixed onboarding stage names and helpers for mapping between stage names and numeric positions.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users to submit basic profile info and saving it via mutation.",
  "frontend/src/components/settings/AdminManagementSection.tsx": "Manages admin users, allowing operators to add or remove admins and view current entries with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, authorization, admin management, and dashboard data, using an actor-based backend API.",
  "frontend/src/index.css": "Configures Tailwind layers and theme variables for light and dark modes with global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/mocks/clientDetailMock.ts": "Generates deterministic mock client detail data including identity, KYC info, and alerts.",
  "frontend/src/mocks/clientsListMock.ts": "Provides a static list of mock client profiles with Swiss-oriented sample data.",
  "frontend/src/pages/AddClientPage.tsx": "Implements a form for creating new clients, saving to backend or fallback local storage.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed client information with editable overview, mock detail data, and merged activity logs.",
  "frontend/src/pages/ClientsPage.tsx": "Renders the clients list with search, sorting, and merged backend/local/mock data, and supports navigation to client detail and add-client pages.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard statistics and a list of upcoming KYC review deadlines using backend data.",
  "frontend/src/pages/KYCScreeningPage.tsx": "Static page header for managing KYC screening and related checks.",
  "frontend/src/pages/OnboardingPage.tsx": "Shows the onboarding pipeline with loading, error handling, and a kanban board view.",
  "frontend/src/pages/ReportsPage.tsx": "Static page header for viewing compliance and risk reports.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page that renders admin management configuration options.",
  "frontend/src/utils/clientActivityLog.ts": "Provides local storage utilities for loading, appending, and clearing per‑client activity logs.",
  "frontend/src/utils/clientOverrides.ts": "Handles loading, saving, and clearing per‑client field overrides in local storage.",
  "frontend/src/utils/clientPdfExport.ts": "Generates a structured PDF content string for a client using profile and mock detail data.",
  "frontend/src/utils/format.ts": "Utility functions for formatting dates, IDs, statuses, risk labels, and expiry status values.",
  "frontend/src/utils/localClients.ts": "Manages local client storage with ID generation, CRUD helpers, and bigint serialization via localStorage.",
  "frontend/src/utils/pdfDownload.ts": "Generates a printable HTML blob, injects title/print script, and opens it in a new window for PDF printing.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and handling hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and layout settings with custom design tokens.",
  "project_state.json": "Project‑level metadata outlining CRM scope, architecture notes, UI specs, and current known issues."
}