{
  "kind": "build_request",
  "title": "Revert to v29 and update sidebar role display logic",
  "projectName": "FE Swiss Financial",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Revert all code to Version 29 state, which had working admin bootstrap, sidebar user info (name and 'User' badge), admin table showing first caller as 'Admin' role with 'System Administrator' name, Add Staff form visible for Admin, and footer displaying 'v29'",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Version 30 broke the admin bootstrap and removed the sidebar user info. Version 29 was working correctly"
        ]
      },
      "acceptanceCriteria": [
        "Admin table shows the first caller as 'Admin' role with 'System Administrator' name",
        "Add Staff form is visible for the Admin user",
        "Sidebar displays user name and role badge above Logout button",
        "All features from v29 are working: Edit Client, Activity Log, Export PDF, clients list, Dashboard, Onboarding, KYC Screening, Reports, Complete Your Profile modal"
      ]
    },
    {
      "id": "REQ-2",
      "text": "In AppLayout.tsx sidebar user info section, replace the hardcoded 'User' badge with dynamic role display by calling useGetMyAdminEntry() with enabled: !!identity. If adminEntry exists, display the role from adminEntry (e.g. 'Admin'). If adminEntry is null or undefined (still loading or user is not an admin), fall back to displaying 'User'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "check if the user has an admin entry using useGetMyAdminEntry(). But CRITICALLY: this hook must have enabled: false until the identity/actor is ready",
          "If adminEntry exists, display the role from adminEntry (e.g. 'Admin'). If adminEntry is null/undefined (still loading or user is not an admin), fall back to showing 'User'"
        ]
      },
      "acceptanceCriteria": [
        "useGetMyAdminEntry() is called with { enabled: !!identity } to prevent premature queries",
        "When adminEntry exists, the sidebar displays the role from adminEntry.role (e.g., 'Admin' or 'Staff')",
        "When adminEntry is null or undefined, the sidebar displays 'User' as fallback",
        "User name displays userProfile?.name directly without any extra characters appended"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the version number in the footer from 'v29' to 'v31'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The version in the footer should be updated to 'v31'"
        ]
      },
      "acceptanceCriteria": [
        "Footer displays 'v31' instead of 'v29'"
      ]
    }
  ],
  "constraints": [
    "Do NOT change the backend at all",
    "Do NOT change AdminManagementSection.tsx",
    "Do NOT change the admin bootstrap logic",
    "Do NOT change Edit Client, Activity Log, Export PDF, clients list, Dashboard, Onboarding, KYC Screening, Reports, or Complete Your Profile modal",
    "The ONLY frontend file that should change from v29 is AppLayout.tsx (sidebar user info role display) and the footer version number"
  ],
  "nonGoals": [
    "Adding new features beyond the specified role display logic",
    "Modifying any backend logic or data structures",
    "Changing authentication or authorization flows",
    "Altering admin management functionality",
    "Updating any UI components other than AppLayout.tsx"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}