{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Swiss Financial CRM — Frontend rollback to Version 23 auth/layout behavior",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Rollback frontend behavior to Version 23 by regressing Version 24–26 UI flow changes and removing any newer auth/layout regressions.",
      "acceptanceCriteria": [
        "After deployment, the app’s behavior matches Version 23 (no Version 24–26 changes remain).",
        "No new functionality introduced in Versions 24–26 is present after the rollback."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Restore Version 23 routing + gate composition so authenticated users consistently land in the authorized layout flow (AuthGate -> AuthorizationGate -> AppLayout/Outlet) without relying on newer gating side-effects. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Regress layout behavior to Version 23 expectations (navigation + authorized shell), removing any Version 24–26-only UI/flow additions that could affect post-login transitions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Rollback query-derived loading/fetched semantics to Version 23 patterns so the UI does not deadlock when the actor is unavailable or authorization queries error; ensure query states allow rendering fallback/error UI rather than indefinite loaders. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Regress any Version 24–26 URL/session secret parameter behavior not present in Version 23 (e.g., handling of hash/session persistence) to avoid interfering with Version 23 login/authorization flow. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore Version 23 auth/authorization transition so Internet Identity login reliably enters the authorized layout without hanging on “Verifying authorization...”.",
      "acceptanceCriteria": [
        "When a user logs in, the app proceeds from the login screen to the authorized app layout (sidebar + routed pages) without indefinite loading.",
        "The authorization loading screen text remains in English and only appears while the actor and authorization status are actually being fetched."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthorizationGate.tsx",
          "operation": "modify",
          "description": "Adjust loading/guard logic to show “Verifying authorization...” only while actor/authorization are actively fetching, and ensure the gate can exit the loading state into either children or a clear error/denied state when actor/auth data is missing or errored (no indefinite loader). Keep the loader text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update authorization/profile query hooks to follow the selected authorization component guidance (actor-dependent enabling, accurate isLoading/isFetched), preventing deadlocks where isFetched never becomes true when the actor is null and avoiding UI hangs after login. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Align the profile setup modal display logic with Version 23 behavior and the selected authorization component guidance to prevent modal flash/hang during actor fetch and post-login transition (only show when authenticated and the profile query has truly resolved to null). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Ensure the login screen remains a stable pre-auth state and does not introduce any Version 24–26 behavior that could block the post-login transition; keep messaging consistent and in English. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}