{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Permanent hardcoded admin initialization fix - Frontend changes",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Remove the useBootstrapAdmin hook from the frontend",
      "acceptanceCriteria": [
        "The useBootstrapAdmin hook file or export no longer exists",
        "No references to useBootstrapAdmin remain in the codebase"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBootstrapAdmin.ts",
          "operation": "delete",
          "description": "Delete the useBootstrapAdmin hook file entirely since bootstrap logic is being moved to automatic backend initialization"
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Remove bootstrap logic from AppLayout.tsx while keeping the sidebar and all UI exactly as v41",
      "acceptanceCriteria": [
        "No bootstrap-related code or useBootstrapAdmin calls exist in AppLayout.tsx",
        "Sidebar navigation remains unchanged from v41",
        "User profile display with dynamic role badge remains unchanged",
        "Logout functionality remains unchanged",
        "Layout and UI structure match v41 exactly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Remove the useBootstrapAdmin import and all bootstrap-related logic including the automatic bootstrapAdmin() call that executes when an authenticated user has no admin entry. Keep all existing UI elements unchanged: sidebar navigation, user profile display with dynamic role badge (Admin/Staff/User), logout functionality, and layout structure. The component should continue to fetch and display the user's admin entry via useGetMyAdminEntry but without any bootstrap fallback logic."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update the version number displayed in the AppLayout footer from 'v41' to 'v42'",
      "acceptanceCriteria": [
        "Footer displays 'v42' instead of 'v41'",
        "Version string is visible in the AppLayout component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the version string in the footer from 'v41' to 'v42' to reflect the new release version"
        }
      ]
    }
  ]
}