{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Operator detection & Add Staff form gating in Settings > Admin Management",
  "requirements": [
    {
      "id": "REQ-75",
      "summary": "Compute isOperator by comparing the logged-in Principal ID against the Operator row Principal ID from the fetched admin entries list (optional fallback to myAdminEntry).",
      "acceptanceCriteria": [
        "When the admin table includes an entry with role Operator whose Principal ID matches the currently logged-in user’s Principal ID, the “Add Staff Member” form is visible.",
        "When the logged-in user’s Principal ID does not match the Operator row Principal ID, the Add Staff form is not visible and the page shows an Operator-only message.",
        "The Operator check is based on comparing the current Principal ID to the Operator row Principal ID from the fetched admin list (not on a heuristic or unrelated field)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/AdminManagementSection.tsx",
          "operation": "modify",
          "description": "Fix Operator detection by deriving the current user Principal ID via the existing Internet Identity context (from the authorization system) and comparing it to the Operator entry's Principal ID found in adminEntries returned by useGetAdminEntries(). Allow useGetMyAdminEntry() only as an optional fallback when adminEntries is unavailable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-76",
      "summary": "Ensure the Add Staff form renders directly below the admin table with the exact controls/labels and calls the existing add-admin mutation with role Staff.",
      "acceptanceCriteria": [
        "As Operator, the Add Staff form appears below the admin table and contains the three required controls: Principal ID input, Display Name input, and “Add Staff” button.",
        "Submitting the form with empty Principal ID or Display Name shows an English validation error and does not call the backend.",
        "Submitting the form with valid values calls the existing add-admin mutation with role Staff and clears the inputs on success."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/AdminManagementSection.tsx",
          "operation": "modify",
          "description": "Confirm the Add Staff form is placed immediately below the admin entries table and contains exactly: (1) Principal ID text input, (2) Display Name text input, (3) “Add Staff” button with English labels and validation messaging; ensure submit calls the existing React Query mutation (useAddAdmin) with role AdminRole.staff and clears inputs on success."
        }
      ]
    },
    {
      "id": "REQ-77",
      "summary": "Refresh the admin entries list after Add Staff success and enforce Remove button visibility rules based on Operator status and row role.",
      "acceptanceCriteria": [
        "After adding a Staff entry, the admin entries table updates to include the new row without requiring a manual page refresh.",
        "When the logged-in user is the Operator, each Staff row shows a Remove button and the Operator row shows no Remove button.",
        "When the logged-in user is not the Operator, the Remove column/buttons are not shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/AdminManagementSection.tsx",
          "operation": "modify",
          "description": "Wire Remove-column visibility and per-row Remove button rendering to the corrected isOperator calculation; ensure the Operator row never shows Remove. Ensure the post-add flow results in the admin entries list refreshing so the new Staff row appears (leveraging the existing React Query invalidation already triggered by the mutation)."
        }
      ]
    }
  ]
}