{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-18T08:11:05.133Z",
  "summary": "REQ-25 and REQ-26 appear implemented (shared layout left inset for sidebar; Add Client CTA in Clients header navigating to /add-client). REQ-27 is only partially met: 5 Swiss-oriented mock clients are seeded when backend list is empty, but at least one mock row has an undefined onboarding date, which violates the requirement that each mock row include a non-empty onboarding date value; additionally, the fallback logic does not explicitly gate on \"not loading\".",
  "missing_requirements": [
    {
      "id": "REQ-27",
      "requirement": "Each mock row must include realistic status, risk level, nationality, relationship manager, and onboarding date values so the table does not appear empty.",
      "reason": "One of the 5 mock clients has `onboardingDate: undefined` (and `kycReviewDue: undefined`), so the Onboarding Date column may be empty for that row, violating the AC that each mock row displays a non-empty onboarding date.",
      "evidence": [
        "frontend/src/mocks/clientsListMock.ts"
      ]
    },
    {
      "id": "REQ-27",
      "requirement": "If the backend client list is empty (and not loading), the Clients table renders exactly 5 mock rows; mock rows are not shown while loading.",
      "reason": "The fallback selection uses `clients.length === 0 ? mockClients : clients` and does not include an explicit `!isLoading` guard; if the query returns an empty array during loading or intermediate states, mocks could appear prematurely. The diff snippet does not show any additional gating later in the render.",
      "evidence": [
        "frontend/src/pages/ClientsPage.tsx"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.68,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/AppLayout.tsx",
    "frontend/src/mocks/clientsListMock.ts",
    "frontend/src/pages/ClientsPage.tsx",
    "project_state.json"
  ]
}